In [1]:
import dask.dataframe as dd

In [17]:
df = dd.read_csv('data/accounts.*.csv', )
df.compute()

         id    names  amount
0       187   Ingrid     457
1       346   Ursula     747
2       350      Dan    1175
3       464    Zelda    -571
4       431    Wendy    4534
...     ...      ...     ...
999995   43      Dan     933
999996  431    Wendy    4913
999997  168   Hannah     323
999998  308  Norbert     -14
999999  353   Ingrid     366

[6000000 rows x 3 columns]

In [30]:
#как работает
a = df["amount"] > 0
a.compute()

0          True
1          True
2          True
3         False
4          True
          ...
999995     True
999996     True
999997     True
999998    False
999999     True
Name: amount, Length: 6000000, dtype: bool

In [15]:
df = df[df["amount"] > 0]
df.compute()

         id   names  amount
0       187  Ingrid     457
1       346  Ursula     747
2       350     Dan    1175
4       431   Wendy    4534
5       375   Jerry     798
...     ...     ...     ...
999994  131  George     153
999995   43     Dan     933
999996  431   Wendy    4913
999997  168  Hannah     323
999999  353  Ingrid     366

[4864173 rows x 3 columns]

In [39]:
a = df.groupby("id").amount.sum()
a.compute()

id
0       5122086
1        264435
2       1285806
3      26141890
4      24399769
         ...
495    13954087
496      873450
497    51580139
498      -68953
499    14145938
Name: amount, Length: 500, dtype: int64

In [40]:
a.idxmax().compute()

165